espressif/arduino-esp32/libraries/BLE/src/BLEServer.cpp
      return 0;
    }  // BLE_GAP_EVENT_DISCONNECT

    case BLE_GAP_EVENT_SUBSCRIBE:
    {
      log_i("subscribe event; attr_handle=%d, subscribed: %s", event->subscribe.attr_handle, (event->subscribe.cur_notify ? "true" : "false"));

      for (auto &it : server->m_notifyChrVec) {
        if (it->getHandle() == event->subscribe.attr_handle) {
          uint16_t properties = it->getProperties();
          if ((properties & BLE_GATT_CHR_F_READ_AUTHEN) || (properties & BLE_GATT_CHR_F_READ_AUTHOR) || (properties & BLE_GATT_CHR_F_READ_ENC)) {
            rc = ble_gap_conn_find(event->subscribe.conn_handle, &desc);
            if (rc != 0) {
              break;
            }

            if (!desc.sec_state.encrypted) {
              BLESecurity::startSecurity(event->subscribe.conn_handle);
            }
          }

          it->setSubscribe(event);
          break;
        }
      }

      return 0;
    }  // BLE_GAP_EVENT_SUBSCRIBE

    case BLE_GAP_EVENT_MTU:
    {
      log_i("mtu update event; conn_handle=%d mtu=%d", event->mtu.conn_handle, event->mtu.value);
      rc = ble_gap_conn_find(event->mtu.conn_handle, &desc);
      if (rc != 0) {
        return 0;
      }

      if (server->m_pServerCallbacks != nullptr) {
        server->m_pServerCallbacks->onMtuChanged(server, &desc, event->mtu.value);
      }
      return 0;
    }  // BLE_GAP_EVENT_MTU

    case BLE_GAP_EVENT_NOTIFY_TX:
    {
      BLECharacteristic *pChar = nullptr;

      for (auto &it : server->m_notifyChrVec) {
        if (it->getHandle() == event->notify_tx.attr_handle) {
          pChar = it;
        }
      }

      if (pChar == nullptr) {
        return 0;
      }

      BLECharacteristicCallbacks::Status statusRC;

      if (event->notify_tx.indication) {
        if (event->notify_tx.status != 0) {
          if (event->notify_tx.status == BLE_HS_EDONE) {
            statusRC = BLECharacteristicCallbacks::Status::SUCCESS_INDICATE;
          } else if (rc == BLE_HS_ETIMEOUT) {
            statusRC = BLECharacteristicCallbacks::Status::ERROR_INDICATE_TIMEOUT;
          } else {
            statusRC = BLECharacteristicCallbacks::Status::ERROR_INDICATE_FAILURE;
          }
        } else {
          return 0;
        }

        server->clearIndicateWait(event->notify_tx.conn_handle);
      } else {
        if (event->notify_tx.status == 0) {
          statusRC = BLECharacteristicCallbacks::Status::SUCCESS_NOTIFY;
        } else {
          statusRC = BLECharacteristicCallbacks::Status::ERROR_GATT;
        }
      }

      pChar->m_pCallbacks->onStatus(pChar, statusRC, event->notify_tx.status);

      return 0;
    }  // BLE_GAP_EVENT_NOTIFY_TX

    case BLE_GAP_EVENT_ADV_COMPLETE:
    {
      log_d("Advertising Complete");
      BLEDevice::getAdvertising()->advCompleteCB();
      return 0;
    }

    case BLE_GAP_EVENT_CONN_UPDATE:
    {
      log_d("Connection parameters updated.");
      return 0;
    }  // BLE_GAP_EVENT_CONN_UPDATE

    case BLE_GAP_EVENT_REPEAT_PAIRING:
    {
      /* We already have a bond with the peer, but it is attempting to
       * establish a new secure link.  This app sacrifices security for
       * convenience: just throw away the old bond and accept the new link.
       */

      /* Delete the old bond. */
      rc = ble_gap_conn_find(event->repeat_pairing.conn_handle, &desc);
      if (rc != 0) {
        return BLE_GAP_REPEAT_PAIRING_IGNORE;
      }

      ble_store_util_delete_peer(&desc.peer_id_addr);

      /* Return BLE_GAP_REPEAT_PAIRING_RETRY to indicate that the host should
       * continue with the pairing operation.
       */
      return BLE_GAP_REPEAT_PAIRING_RETRY;
    }  // BLE_GAP_EVENT_REPEAT_PAIRING

    case BLE_GAP_EVENT_ENC_CHANGE:
    {
      rc = ble_gap_conn_find(event->enc_change.conn_handle, &desc);
      if (rc != 0) {
        return BLE_ATT_ERR_INVALID_HANDLE;
      }

      if (BLEDevice::m_securityCallbacks != nullptr) {
        BLEDevice::m_securityCallbacks->onAuthenticationComplete(&desc);
      } else if (server->m_pServerCallbacks != nullptr) {
        server->m_pServerCallbacks->onAuthenticationComplete(&desc);
      }

      return 0;
    }  // BLE_GAP_EVENT_ENC_CHANGE

    case BLE_GAP_EVENT_PASSKEY_ACTION:
    {
      struct ble_sm_io pkey = {0, 0};

      if (event->passkey.params.action == BLE_SM_IOACT_DISP) {
        pkey.action = event->passkey.params.action;
        // backward compatibility
        pkey.passkey = BLESecurity::m_passkey;
        // if the (static)passkey is the default, check the callback for custom value
        // both values default to the same.
        if (pkey.passkey == BLE_SM_DEFAULT_PASSKEY) {
          if (server->m_pServerCallbacks != nullptr) {
            pkey.passkey = server->m_pServerCallbacks->onPassKeyRequest();
          }
        }
        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("BLE_SM_IOACT_DISP; ble_sm_inject_io result: %d", rc);

      } else if (event->passkey.params.action == BLE_SM_IOACT_NUMCMP) {
        log_d("Passkey on device's display: %d", event->passkey.params.numcmp);
        pkey.action = event->passkey.params.action;
        // Compatibility only - Do not use, should be removed the in future
        if (BLEDevice::m_securityCallbacks != nullptr) {
          pkey.numcmp_accept = BLEDevice::m_securityCallbacks->onConfirmPIN(event->passkey.params.numcmp);
        } else if (server->m_pServerCallbacks != nullptr) {
          pkey.numcmp_accept = server->m_pServerCallbacks->onConfirmPIN(event->passkey.params.numcmp);
        }

        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("BLE_SM_IOACT_NUMCMP; ble_sm_inject_io result: %d", rc);

        //TODO: Handle out of band pairing
      } else if (event->passkey.params.action == BLE_SM_IOACT_OOB) {
        static uint8_t tem_oob[16] = {0};
        pkey.action = event->passkey.params.action;
        for (int i = 0; i < 16; i++) {
          pkey.oob[i] = tem_oob[i];
        }
        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("BLE_SM_IOACT_OOB; ble_sm_inject_io result: %d", rc);
      } else if (event->passkey.params.action == BLE_SM_IOACT_INPUT) {
        log_d("Enter the passkey");
        pkey.action = event->passkey.params.action;

        // Compatibility only - Do not use, should be removed the in future
        if (BLEDevice::m_securityCallbacks != nullptr) {
          pkey.passkey = BLEDevice::m_securityCallbacks->onPassKeyRequest();
        } else if (server->m_pServerCallbacks != nullptr) {
          pkey.passkey = server->m_pServerCallbacks->onPassKeyRequest();
        }

        rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
        log_d("BLE_SM_IOACT_INPUT; ble_sm_inject_io result: %d", rc);

