espressif/arduino-esp32/libraries/BLE/src/BLEServer.cpp
      } else if (event->passkey.params.action == BLE_SM_IOACT_NONE) {
        log_d("No passkey action required");
      }

      log_d("<< handleGATTServerEvent");
      return 0;
    }  // BLE_GAP_EVENT_PASSKEY_ACTION

    default: break;
  }

  log_d("<< handleGATTServerEvent");
  return 0;
}

/**
 * @brief Request an Update the connection parameters:
 * * Can only be used after a connection has been established.
 * @param [in] conn_handle The connection handle of the peer to send the request to.
 * @param [in] minInterval The minimum connection interval in 1.25ms units.
 * @param [in] maxInterval The maximum connection interval in 1.25ms units.
 * @param [in] latency The number of packets allowed to skip (extends max interval).
 * @param [in] timeout The timeout time in 10ms units before disconnecting.
 */
void BLEServer::updateConnParams(uint16_t conn_handle, uint16_t minInterval, uint16_t maxInterval, uint16_t latency, uint16_t timeout) {
  ble_gap_upd_params params;

  params.latency = latency;
  params.itvl_max = maxInterval;                        // max_int = 0x20*1.25ms = 40ms
  params.itvl_min = minInterval;                        // min_int = 0x10*1.25ms = 20ms
  params.supervision_timeout = timeout;                 // timeout = 400*10ms = 4000ms
  params.min_ce_len = BLE_GAP_INITIAL_CONN_MIN_CE_LEN;  // Minimum length of connection event in 0.625ms units
  params.max_ce_len = BLE_GAP_INITIAL_CONN_MAX_CE_LEN;  // Maximum length of connection event in 0.625ms units

  int rc = ble_gap_update_params(conn_handle, &params);
  if (rc != 0) {
    log_e("Update params error: %d, %s", rc, BLEUtils::returnCodeToString(rc));
  }
}  // updateConnParams

bool BLEServer::setIndicateWait(uint16_t conn_handle) {
  for (auto i = 0; i < CONFIG_BT_NIMBLE_MAX_CONNECTIONS; i++) {
    if (m_indWait[i] == conn_handle) {
      return false;
    }
  }

  return true;
}

void BLEServer::clearIndicateWait(uint16_t conn_handle) {
  for (auto i = 0; i < CONFIG_BT_NIMBLE_MAX_CONNECTIONS; i++) {
    if (m_indWait[i] == conn_handle) {
      m_indWait[i] = BLE_HS_CONN_HANDLE_NONE;
      return;
    }
  }
}

/**
 * @brief Disconnect the specified client with optional reason.
 * @param [in] connId Connection Id of the client to disconnect.
 * @param [in] reason code for disconnecting.
 * @return NimBLE host return code.
 */
int BLEServer::disconnect(uint16_t connId, uint8_t reason) {
  log_d(">> disconnect()");

  int rc = ble_gap_terminate(connId, reason);
  if (rc != 0) {
    log_e("ble_gap_terminate failed: rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
  }

  log_d("<< disconnect()");
  return rc;
}  // disconnect

/**
 * @brief Set the service changed flag
 */
void BLEServer::serviceChanged() {
  if (m_gattsStarted) {
    m_svcChanged = true;
  }
}  // serviceChanged

// NimBLE callbacks

void BLEServerCallbacks::onConnect(BLEServer *pServer, struct ble_gap_conn_desc *desc) {
  log_d("BLEServerCallbacks", ">> onConnect(): Default");
  log_d("BLEServerCallbacks", "Device: %s", BLEDevice::toString().c_str());
  log_d("BLEServerCallbacks", "<< onConnect()");
}  // onConnect

void BLEServerCallbacks::onDisconnect(BLEServer *pServer, struct ble_gap_conn_desc *desc) {
  log_d("BLEServerCallbacks", ">> onDisconnect(): Default");
  log_d("BLEServerCallbacks", "Device: %s", BLEDevice::toString().c_str());
  log_d("BLEServerCallbacks", "<< onDisconnect()");
}  // onDisconnect

void BLEServerCallbacks::onMtuChanged(BLEServer *pServer, ble_gap_conn_desc *desc, uint16_t mtu) {
  log_d("BLEServerCallbacks", ">> onMtuChanged(): Default");
  log_d("BLEServerCallbacks", "Device: %s MTU: %d", BLEDevice::toString().c_str(), mtu);
  log_d("BLEServerCallbacks", "<< onMtuChanged()");
}  // onMtuChanged

uint32_t BLEServerCallbacks::onPassKeyRequest() {
  log_d("BLEServerCallbacks", "onPassKeyRequest: default: 123456");
  return 123456;
}

void BLEServerCallbacks::onAuthenticationComplete(ble_gap_conn_desc *) {
  log_d("BLEServerCallbacks", "onAuthenticationComplete: default");
}

bool BLEServerCallbacks::onConfirmPIN(uint32_t pin) {
  log_d("BLEServerCallbacks", "onConfirmPIN: default: true");
  return true;
}

#endif  // CONFIG_NIMBLE_ENABLED

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED */
